app/controllers/api/applicants_controller.rb

    def show
      applicant = Applicant.find(params[:id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1  ORDER BY "applicants"."id" ASC LIMIT 1  [["id", 6]]

    def update
      applicant = Applicant.find(params[:id])
      applicant.update!(update_params)
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1  ORDER BY "applicants"."id" ASC LIMIT 1  [["id", 6]]
UPDATE "applicants" SET "org" = $1, "address" = $2, "city" = $3, "state" = $4, "website" = $5, "mission" = $6, "position" = $7, "updated_at" = $8 WHERE "applicants"."id" = $9  [["org", "org"], ["address", "add"], ["city", "c"], ["state", "s"], ["website", "w"], ["mission", "m"], ["position", "p"], ["updated_at", "2016-06-14 20:23:56.650788"], ["id", 6]]

    def upload
      applicant = Applicant.find(params[:applicant_id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1  ORDER BY "applicants"."id" ASC LIMIT 1  [["id", 6]]

    def submit
      applicant = Applicant.find(params[:applicant_id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1  ORDER BY "applicants"."id" ASC LIMIT 1  [["id", 6]]

    def decide
      applicant = Applicant.find(params[:applicant_id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT 1  [["id", 6]]

    def comment
      applicant = Applicant.find(params[:applicant_id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT 1  [["id", 6]]

    def schedule
      applicant = Applicant.find(params[:applicant_id])
---
SELECT  "applicants".* FROM "applicants" WHERE "applicants"."id" = $1 LIMIT 1  [["id", 6]]